[
    {
        "id": 0,
        "name": "Scrambled eggs",
        "image_url": "https://jaidensiu.vercel.app/scrambled-eggs.jpg",
        "video_url": "https://youtube.com/scrambled-eggs-tutorial",
        "cooking_steps": [
            "Crack 3 eggs into a bowl and whisk them thoroughly.",
            "Add a splash of milk or cream, and season with salt and pepper.",
            "Heat a non-stick skillet over medium heat and add butter.",
            "Pour the egg mixture into the skillet and let it sit for a few seconds.",
            "Using a spatula, gently stir the eggs, pushing from the edges toward the center.",
            "Cook until the eggs are softly set and slightly runny in places.",
            "Remove from heat and serve immediately."
        ]
    },
    {
        "id": 1,
        "name": "Steamed eggs",
        "image_url": "https://jaidensiu.vercel.app/steamed-eggs.jpg",
        "video_url": "https://youtube.com/steamed-eggs-tutorial",
        "cooking_steps": [
            "Crack 2-3 eggs into a bowl and whisk until smooth.",
            "Add twice the amount of warm water or stock to the eggs and mix well.",
            "Strain the mixture through a sieve to remove bubbles.",
            "Pour the mixture into a heatproof bowl or ramekin.",
            "Cover the bowl with plastic wrap or foil.",
            "Place the bowl in a steamer over medium heat and steam for 10-15 minutes.",
            "Check for a silky, custard-like texture before serving.",
            "Optionally, drizzle with soy sauce and sesame oil before serving."
        ]
    },
    {
        "id": 2,
        "name": "Fried eggs",
        "image_url": "https://jaidensiu.vercel.app/fried-eggs.jpg",
        "video_url": "https://youtube.com/fried-eggs-tutorial",
        "cooking_steps": [
            "Heat a non-stick skillet over medium heat.",
            "Add a small amount of oil or butter to the pan.",
            "Crack an egg into the pan.",
            "Cook until the white is set and edges are crispy.",
            "For sunny-side-up, serve as is; for over-easy, flip and cook for 30 seconds."
        ]
    },
    {
        "id": 3,
        "name": "Poached eggs",
        "image_url": "https://jaidensiu.vercel.app/poached-eggs.jpg",
        "video_url": "https://youtube.com/poached-eggs-tutorial",
        "cooking_steps": [
            "Bring a pot of water to a gentle simmer.",
            "Add a tablespoon of vinegar to the water.",
            "Crack an egg into a small bowl.",
            "Create a gentle whirlpool in the water and slide the egg into the center.",
            "Cook for 3-4 minutes until the white is set and the yolk is runny.",
            "Remove with a slotted spoon and serve immediately."
        ]
    },
    {
        "id": 4,
        "name": "Boiled eggs",
        "image_url": "https://jaidensiu.vercel.app/boiled-eggs.jpg",
        "video_url": "https://youtube.com/hard-boiled-eggs-tutorial",
        "cooking_steps": [
            "Place eggs in a pot and cover with cold water.",
            "Bring water to a boil over high heat.",
            "Once boiling, reduce heat to medium and simmer for the desired time based on preferences: 4-6 minutes for soft-boiled (runny yolk), 7-8 minutes for medium-boiled (slightly runny yolk), and 9-12 minutes for hard-boiled (fully cooked yolk).",
            "Remove eggs and place them in an ice water bath for 5 minutes.",
            "Peel and serve."
        ]
    }
]